Marc0-dev/SJ413-clock/CarClock/src/ch32v003Oled.c
#include "ch32v003Oled.h"
const uint8_t initSequence[] = {
    0XAE,
    0x00,
    0x10,
    0x00,
    0xB0,
    0x81,
    0xff,
    0xA0,
    0xA6,
    0xA8,
    0x1F,
    0xC8,
    0xD3,
    0x00,
    0xD5,
    0x80,
    0xD9,
    0x1f,
    0xDA,
    0x00,
    0xdb,
    0x40,
    0x8d,
    0x14,
    0x20,
    0x01,
    0xA4,
    0xAF
};
const uint8_t Font[CHARACTER_NUMBER][24][4] = {//to reduce
    {
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x80, 0xFF, 0xFF, 0x01},
        {0x80, 0xFF, 0xFF, 0x01},
        {0x80, 0xFF, 0xFF, 0x01},
        {0xE0, 0x00, 0x00, 0x0E},
        {0xE0, 0x00, 0x00, 0x0E},
        {0xE0, 0x00, 0x00, 0x0E},
        {0xE0, 0x00, 0x00, 0x0E},
        {0xE0, 0x00, 0x00, 0x0E},//0
        {0xE0, 0x00, 0x00, 0x0E},
        {0xE0, 0x00, 0x00, 0x0E},
        {0xE0, 0x00, 0x00, 0x0E},
        {0xE0, 0x00, 0x00, 0x0E},
        {0xE0, 0x00, 0x00, 0x0E},
        {0xE0, 0x00, 0x00, 0x0E},
        {0xE0, 0x00, 0x00, 0x0E},
        {0x80, 0xFF, 0xFF, 0x01},
        {0x80, 0xFF, 0xFF, 0x01},
        {0x80, 0xFF, 0xFF, 0x01},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00}
    },
    {
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x38, 0x00, 0xE0, 0x00},
        {0x38, 0x00, 0xE0, 0x00},
        {0x38, 0x00, 0xE0, 0x00},
        {0x38, 0x00, 0xE0, 0x00},
        {0x38, 0x00, 0xE0, 0x00},
        {0x38, 0x00, 0xE0, 0x00},
        {0x38, 0x00, 0x00, 0x07},
        {0x38, 0x00, 0x00, 0x07},
        {0x38, 0x00, 0x00, 0x07},
        {0xF8, 0xFF, 0xFF, 0x07},//1
        {0xF8, 0xFF, 0xFF, 0x07},
        {0xF8, 0xFF, 0xFF, 0x07},
        {0x38, 0x00, 0x00, 0x00},
        {0x38, 0x00, 0x00, 0x00},
        {0x38, 0x00, 0x00, 0x00},
        {0x38, 0x00, 0x00, 0x00},
        {0x38, 0x00, 0x00, 0x00},
        {0x38, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00}
    },
    {
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0b01110000, 0x00, 0b11111000, 0b00000001},
        {0b01110000, 0x00, 0b11111000, 0b00000001},
        {0b01110000, 0x00, 0b11111000, 0b00000001},
        {0b11110000, 0b00000011, 0x00, 0b00001110},
        {0b11110000, 0b00000011, 0x00, 0b00001110},
        {0b11110000, 0b00000011, 0x00, 0b00001110},
        {0b01110000, 0b00011100, 0x00, 0b00001110},
        {0b01110000, 0b00011100, 0x00, 0b00001110},//2
        {0b01110000, 0b00011100, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b11110000, 0b00000011, 0xFF, 0b00000001},
        {0b11110000, 0b00000011, 0xFF, 0b00000001},
        {0b11110000, 0b00000011, 0xFF, 0b00000001},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00}
    },
    {
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0b10000000, 0b00000011, 0b11000000, 0b00000001},
        {0b10000000, 0b00000011, 0b11000000, 0b00000001},
        {0b10000000, 0b00000011, 0b11000000, 0b00000001},
        {0b01110000, 0x00, 0x00, 0b00001110},
        {0b01110000, 0x00, 0x00, 0b00001110},
        {0b01110000, 0x00, 0x00, 0b00001110},
        {0b01110000, 0x00, 0x00, 0b00001110},
        {0b01110000, 0x00, 0x00, 0b00001110},//3
        {0b01110000, 0x00, 0x00, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b10000000, 0xFF, 0b11000111, 0b00000001},
        {0b10000000, 0xFF, 0b11000111, 0b00000001},
        {0b10000000, 0xFF, 0b11000111, 0b00000001},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00}
    },
    {
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0b00000111, 0x00},
        {0x00, 0x00, 0b00000111, 0x00},
        {0x00, 0x00, 0b00000111, 0x00},
        {0x00, 0b11100000, 0b11111000, 0b00001111},
        {0x00, 0b11100000, 0b11111000, 0b00001111},
        {0x00, 0b11100000, 0b11111000, 0b00001111},
        {0x00, 0b11100000, 0x00, 0x00},
        {0x00, 0b11100000, 0x00, 0x00},
        {0x00, 0b11100000, 0x00, 0x00},
        {0x00, 0b11100000, 0x00, 0x00},//4
        {0x00, 0b11100000, 0x00, 0x00},
        {0x00, 0b11100000, 0x00, 0x00},
        {0x00, 0b11100000, 0x00, 0x00},
        {0x00, 0b11100000, 0x00, 0x00},
        {0x00, 0b11100000, 0x00, 0x00},
        {0b11110000, 0xFF, 0xFF, 0b00001111},
        {0b11110000, 0xFF, 0xFF, 0b00001111},
        {0b11110000, 0xFF, 0xFF, 0b00001111},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00}
    },
    {
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0b10000000, 0b00011111, 0b11111000, 0b00001111},
        {0b10000000, 0b00011111, 0b11111000, 0b00001111},
        {0b10000000, 0b00011111, 0b11111000, 0b00001111},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},//5
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b10000000, 0xFF, 0b00000111, 0b00001110},
        {0b10000000, 0xFF, 0b00000111, 0b00001110},
        {0b10000000, 0xFF, 0b00000111, 0b00001110},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00}
    },
    {
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0b10000000, 0xFF, 0b00111111, 0x00},
        {0b10000000, 0xFF, 0b00111111, 0x00},
        {0b10000000, 0xFF, 0b00111111, 0x00},
        {0b01110000, 0b11100000, 0b11000000, 0b00000001},
        {0b01110000, 0b11100000, 0b11000000, 0b00000001},
        {0b01110000, 0b11100000, 0b11000000, 0b00000001},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},//6
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b10000000, 0b00011111, 0x00, 0x00},
        {0b10000000, 0b00011111, 0x00, 0x00},
        {0b10000000, 0b00011111, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00}
    },
    {
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0b11000000, 0b00001111},
        {0x00, 0x00, 0b11000000, 0b00001111},
        {0x00, 0x00, 0b11000000, 0b00001111},
        {0x00, 0x00, 0x00, 0b00001110},
        {0x00, 0x00, 0x00, 0b00001110},
        {0x00, 0x00, 0x00, 0b00001110},
        {0b11110000, 0b00011111, 0b00000111, 0b00001110},
        {0b11110000, 0b00011111, 0b00000111, 0b00001110},
        {0b11110000, 0b00011111, 0b00000111, 0b00001110},
        {0x00, 0b11100000, 0x00, 0b00001110},//7
        {0x00, 0b11100000, 0x00, 0b00001110},
        {0x00, 0b11100000, 0x00, 0b00001110},
        {0x00, 0b00011100, 0b00000111,0b00001110},
        {0x00, 0b00011100, 0b00000111,0b00001110},
        {0x00, 0b00011100, 0b00000111,0b00001110},
        {0x00, 0x00, 0b11111000, 0b00001111},
        {0x00, 0x00, 0b11111000, 0b00001111},
        {0x00, 0x00, 0b11111000, 0b00001111},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00}
    },
    {
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0b10000000, 0xFF, 0b11000111, 0b00000001},
        {0b10000000, 0xFF, 0b11000111, 0b00000001},
        {0b10000000, 0xFF, 0b11000111, 0b00000001},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},//8
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b01110000, 0x00, 0b00111000, 0b00001110},
        {0b10000000, 0xFF, 0b11000111, 0b00000001},
        {0b10000000, 0xFF, 0b11000111, 0b00000001},
        {0b10000000, 0xFF, 0b11000111, 0b00000001},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
    },
    {
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0xFF, 0b00000001},
        {0x00, 0x00, 0xFF, 0b00000001},
        {0x00, 0x00, 0xFF, 0b00000001},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b01110000, 0b11100000, 0x00, 0b00001110},//9
        {0b01110000, 0b11100000, 0x00, 0b00001110},
        {0b10000000, 0b11100011, 0x00, 0b00001110},
        {0b10000000, 0b11100011, 0x00, 0b00001110},
        {0b10000000, 0b11100011, 0x00, 0b00001110},
        {0b10000000, 0b11100011, 0x00, 0b00001110},
        {0x00, 0b11111100, 0xFF, 0b00000001},
        {0x00, 0b11111100, 0xFF, 0b00000001},
        {0x00, 0b11111100, 0xFF, 0b00000001},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
    },
    {
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0b11110000, 0x00, 0x00, 0b00001111},
        {0b11110000, 0x00, 0x00, 0b00001111},//:
        {0b11110000, 0x00, 0x00, 0b00001111},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
        {0x00, 0x00, 0x00, 0x00},
    }
};
void StartOled(){
    IIC_Init(400000, SCREEN_ADDRESS);
    while( I2C_GetFlagStatus(I2C1, I2C_FLAG_BUSY) != RESET);
    I2C_GenerateSTART(I2C1, ENABLE);
    while( !I2C_CheckEvent( I2C1, I2C_EVENT_MASTER_MODE_SELECT ) );
    I2C_Send7bitAddress( I2C1, SCREEN_ADDRESS, I2C_Direction_Transmitter );
    while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED));
    while (I2C_GetFlagStatus(I2C1, I2C_FLAG_TXE) == RESET);
}
void ResetCursor(){
    StartOled();
    I2C_SendData(I2C1, COMMAND_MODE);
    while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
    I2C_SendData(I2C1, 0xB0);
    while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
    I2C_SendData(I2C1, 0x00);
    while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
    I2C_SendData(I2C1, 0x10);
    while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
    I2C_GenerateSTOP(I2C1, ENABLE);

}
void OledClear(){
    StartOled();
    uint16_t i;
    I2C_SendData(I2C1, DATA_MODE);
    while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
    for( i = 128*8; i; i--){
        I2C_SendData(I2C1, 0x00);
        while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
    }
    I2C_GenerateSTOP(I2C1, ENABLE);
    ResetCursor();
}
void SendPadding(){//usare a trasmissione già avviata
    for(short i = 0; i < 4; i++){
        I2C_SendData(I2C1, 0x00);
        while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
    }
}
void OledFill(uint8_t b){
    StartOled();
    uint16_t i;
    I2C_SendData(I2C1, DATA_MODE);
    while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
    for( i = 128*8; i; i--){
        I2C_SendData(I2C1, b);
        while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
    }
    I2C_GenerateSTOP(I2C1, ENABLE);
    ResetCursor();
}
void OledPrintChar(int index){
    StartOled();
    I2C_SendData(I2C1, DATA_MODE);
    while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
    for(int i = 0; i < 24; i++){
        for(int j = 0; j < 4; j++){
            I2C_SendData(I2C1, Font[index][i][j]);
            while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
        }
        SendPadding();
    }
    I2C_GenerateSTOP(I2C1, ENABLE);
}
void OledInit(){
    StartOled();
    I2C_SendData(I2C1, COMMAND_MODE);
    while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
    for(int i = 0; i < (sizeof(initSequence)/sizeof(uint8_t)); i++){
        I2C_SendData(I2C1, initSequence[i]);
        while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
    }
    I2C_GenerateSTOP(I2C1, ENABLE);
    OledClear();

}